#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>
#include <string.h>

using namespace std;


bool is_cifra(char s) 
{   // 48 - 57 || '0' - '9'
    return (s >= '0' && s <= '9');
}

bool is_glas(char s) // aoueiyAOUEIY
{
    char gl[] = "aoueiyAOUEIY";
    for (int i = 0; i < gl[i]; i++)
    {
        if (s == gl[i])
        {
            return true;
        }
    }
    return false;
}

bool is_cyril(char s)
{
    return (s >= 'А' && s <= 'я');
}

void revers(const char* s) // test --> tset
{
    int count = strlen(s) - 1;
    for (;count > 0; count--)
    {
        cout << s[count];
    }
}



int main()
{

    //setlocale(LC_ALL, "rus");

    // https://en.cppreference.com/w/c/string/byte
    // https://kvodo.ru/tablitsa-windows-1251.html

    // ---------------------------------------------------------------------------------------------------------------- //
    // ****************************************** Си-строки, функции строк ******************************************** //

    //char str[]{ "Hello, World!" };

    //cout << str << endl;

    ////for (int i = 0; str[i] != '\0'; i++)
    ////for (int i = 0; sizeof(str) - 1; i++)
    //for (int i = 0;str[i]; i++)
    //{
    //    cout << str[i] << " ";
    //}


    // ---------------------------------------------------------------------------------------------------------------- //
    // Вывод строки с клавиатуры: 

    //char product[50];
    //cout << "\nВведи наименование товара: ";
    ////cin >> product; // считывание строки до первого пробела
    //cin.getline(product, sizeof(product)); // считываение строки целиком
    //cout << "\nВыш товар: " << product;


    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Дана строка. Заменить в ней все пробелы на *
    */
#if 0

    char str[50] = "    H ello,      Wo r l  d   !";
    for (int i = 0; i < str[i]; i++)
    {
        if (str[i] == ' ')
        {
            str[i] = '*';
        }
    }

    cout << str << endl;

#endif

    // ---------------------------------------------------------------------------------------------------------------- //
    // Получение кода клавмш

#if 0
    cout << (int)'a' << endl;
    int key = 0;

    while (key != 27)
    {
        cout << "\nНажми клавишу: ";
        key = _getch();
        cout << key << endl;
    }

#endif


    // ---------------------------------------------------------------------------------------------------------------- //
    // Количество символов в строке - функция strlen

#if 0
    char str[]{ "Hello, World!" };
    int i = 0;
    for (; i < str[i]; i++);
    cout << "\nКоличество символов в строке: " << i << endl;
    
    // Используя стандартную функцию  strlen;
    cout << "\nКоличество символов в строке: " << strlen(str) << endl;
    int count = strlen(str);
    cout << "\nКоличество символов в строке: " << count << endl;
#endif


    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Регистр всех символов строки         
    strupr - перевод всей строки в верхний регистр
    strlwr - перевод всей строки в нижний регистр  
       
    Регистр символов строки отдельно         
    toupper - перевод одного символа в верхний регистр
    tolower - перевод одного символа в нижний регистр
    */

#if 0
    char str[50]{ "Hello, World!" };
    _strupr_s(str);
    cout << str << endl;
    _strlwr_s(str);
    cout << str << endl;

    cout << (int)'H' << " " << (int)'h' << endl << endl;

    *str = toupper(*str);
    cout << str << endl;
    str[0] = toupper(str[0]);
    cout << str << endl;

    *str = tolower(*str);
    cout << str << endl;
    str[0] = tolower(str[0]);
    cout << str << endl;
#endif


    // ---------------------------------------------------------------------------------------------------------------- //
    // скопировать строку s2 в s1 без использоания функции
#if 0
    char s2[20] = "Hello, spring!", s1[20] = "";
    cout << s1 << endl;

    for (int i = 0; i < s2[i]; i++)
    {
        s1[i] = s2[i];
    }

    cout << s1 << endl;
 
#endif

    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Скопировать строку s2 в s1 при помощи стандартной функции strcpy
    */
    /*
    Копирование строк
        strcpy
        strncpy
    */

#if 0
    char s2[20] = "Hello, spring!", s1[20];

    strcpy_s(s1, s2);
    cout << s1 << endl;
    cout << "\nКоличество символов в строке: " << strlen(s1) << endl;

    strncpy_s(s1, s2, 5);
    cout << s1 << endl;
    cout << "\nКоличество символов в строке: " << strlen(s1) << endl;

#endif



    // ---------------------------------------------------------------------------------------------------------------- //
    /* Конкатенация строк
        strcat
        strncat
    */

    // Добавить в строку с фамилией строку с именем через пробел
    // (Имя и фамилия вводятся с клавиатуры)

#if 0
    char fio[60] = "Semenov", name[20]{ "Dima" }, lname[20] = "Fiodor";
    cout << fio << endl;
    strcat_s(fio, " ");
    strcat_s(fio, name);
    strcat_s(fio, " ");
    //strcat_s(fio, lname);
    strncat_s(fio, lname, 1);
    strcat_s(fio, "!");


    cout << fio << endl;
    cout << "\nКоличество символов в строке: " << strlen(fio) << endl;

#endif


    // ---------------------------------------------------------------------------------------------------------------- //
    // Написать программу, которая конкатенирует две строки, разделив их пробелом, 
    //и результат записывает в третью строку(пустая строка)

#if 0
    char fio[60], surname[20]{"Semenov"}, name[20] = "Dima";

    strcpy_s(fio, surname);
    strcat_s(fio, " ");
    strcat_s(fio, name);

    //strcat_s(fio, surname);
    //strcat_s(fio, " ");
    //strcat_s(fio, name);

    cout << fio << endl;

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Получить из символа-цифры (char) значение цифры (int)
    */

#if 0
    //cout << '0' << endl << 0 << endl;
    //cout << '1' << endl << 1 << endl;

    char s = '5';
    short digit;

    //digit = s - '0';
    digit = s - 48;

    cout << "\ndigit = " << digit << endl;

#endif 


    // ---------------------------------------------------------------------------------------------------------------- //
    //Конвертация строки в целое число – atoi

#if 0

    char str_year[] = "2023";
    int year;
    year = atoi(str_year);

    cout << year;

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    //Конвертация целого числа в строку   -    itoa

#if 0

    int year = 2023;
    char str_year[5], res[60]{"Возраст: "};
    _itoa_s(year, str_year, 10);
    cout << str_year << endl;

    strcat_s(res, str_year);
    cout << res << endl;

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    // bool is_cifra(char s);
    //Написать функцию, которая определяет является ли символ цифрой '0' ..... '9'

#if 0

    char s = '6';
    if (is_cifra(s))
    {
        cout << "\nСимвол является цифрой";
    }
    else {
        cout << "\nСимвол не является цифрой";
    }

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    // Класификация символов
    // Библиотечная функция, является ли символ знаком и тп

#if 0

    char s = '6';
    if (isdigit(s))
    {
        cout << "\nСимвол является цифрой";
    }
    else {
        cout << "\nСимвол не является цифрой";
    }

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Написать функцию, которая определяет,
    является ли символ гласным:  aoueiyAOUEIY     bool is_glas(char s);
    */

#if 0

    char s = 'A';
    if (is_glas(s))
    {
        cout << "\nСимвол является гласным";
    }
    else {
        cout << "\nСимвол не является гласным";
    }

#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Посчитать количество гласных символов в строке.
    aoueiy
    */

#if 0

    char str[] = "Hello, World!"; 
    int gl = 0;
    for (int i = 0; i < str[i]; i++)
    {
        if (is_glas(str[i]))
        {
            gl++;
        }
    }
    cout << "\nКоличество гласных в строке: " << gl;

#endif 


    // ---------------------------------------------------------------------------------------------------------------- //
    /*
    Написать функцию, которая определяет, является ли символ-кириллицей.
    Посчитать количество символов русского языка в строке.
    */

#if 0

    char s = 'Ю';
    if (is_cyril(s))
    {
        cout << "\nСимвол является кириллицей";
    }
    else {
        cout << "\nСимвол не является кириллицей";
    }


#endif 

    // ---------------------------------------------------------------------------------------------------------------- //
    char str[]{"Hello!"};
    revers(str);

    cout << endl << endl;
    _strrev(str);
    cout << str << endl;

    _getch();
}