#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>

using namespace std;

void main()
{
    setlocale(LC_CTYPE, "rus");

    //int x = 25, y = 0;
    //(x % 5 == 0) ? (x = 1, y = -1) : (x = -10, y = 5);

    //cout << x << " " << y << endl;

    //int x = 26;
    //(x % 5 == 0) ? (x = 1, y = -1) : (cout << "\n = ", y = 5);


    // ------------------------------------------------------------------------------------------------------------------- \\

    //// if (t)  ~ if (t !=0)
    //// if (!t)  ~ if (t == 0)
    //// if (!(t % 2))  ~ if (t % 2 == 0)

    //int t = 10;

    //if (t)
    //{
    //    cout << t << endl;
    //}
    //else {
    //    cout << "\nЗначение нулевое";
    //}

    // if (t % 2)  ~ if (t % 2 != 0)
    //if (t % 2)
    //{
    //    cout << "\nЧисло нечетное";
    //}
    //else {
    //    cout << "\nЧисло четное";
    //}

    // ------------------------------------------------------------------------------------------------------------------- \\
    // Структура повторения ---------------------------------------------------------------------------------------------- \\
    // Цикл while -------------------------------------------------------------------------------------------------------- \\
    // ------------------------------------------------------------------------------------------------------------------- \\

    // структура повторения(циклы): повторение по счетчику - while

    /*
    Программа выводит на экран  10 звездочек в ряд.
    */

    //int k;                      // 1. Переменая счетчик
    //k = 0;                      // 2. Начальное значение счетчика

    //while (k < 10)
    //{
    //    cout << "* ";           // Действие в цикле
    //    k++;                    // Изминение значение счетчика
    //}
    //cout << endl << endl;

    ///*
    //Программа выводит на экран  5 # в ряд.
    //*/

    //k = 5;
    //while (k)
    //{
    //    cout << "# ";
    //    k--;
    //}

    //cout << endl << endl;


    // ------------------------------------------------------------------------------------------------------------------- \\
    // Унарные операции: ++ --  -(смена знака)

    //int a = 8;

    //a++; // Посфиксная форма (++ Выполняется на следующем этапе)

    //cout << "\na = " << a << endl; // 9

    //++a; // Префиксная форма (++ Выполняется на первом этапе)

    //cout << "\na = " << a << endl; // 10


    //cout << "\na++ = " << a++ << endl; // 10
    //cout << "\na = " << a << endl; // 11

    //cout << "\na++ = " << ++a << endl; // 12

    //cout << -a << endl; // Меняем с положительного на отрицательное число



    // ------------------------------------------------------------------------------------------------------------------- \\

    //Программа запрашивает целое число n и символ s,
    //    и    выводит на экран n символов подряд.

    //int num;
    //char s;

    //cout << "\nВведите кол-во символов: ";
    //cin >> num;
    //
    //cout << "\nВведите символ: ";
    //cin >> s;

    //while (num)
    //{
    //    cout << s << " ";
    //    num--;
    //}
    
    
    //int num,k = 0;
    //char s;

    //cout << "\nВведите кол-во символов: ";
    //cin >> num;
    //
    //cout << "\nВведите символ: ";
    //cin >> s;

    //while (k < num)
    //{
    //    cout << s << " ";
    //    k++;
    //}
    

    
        
    // ------------------------------------------------------------------------------------------------------------------- \\

    /*
    Программа выводит на экран числа от 1 до 10.
    */

    //int k = 0;

    //while (k < 10)
    //{
    //    cout << k + 1 << " ";
    //    k++;
    //}

    /*
    Программа выводит на экран числа от 10 до 1.
    */

    //int k = 10;

    //while (k > 0)
    //{
    //    cout << k << " ";
    //    k--;
    //}



    // ------------------------------------------------------------------------------------------------------------------- \\

    /*
    Программа запрашивает два числа а и в (а меньше b)
    и выводит на экран числа в диапазоне от а до в.

    5 10
    4 6 7 8 9 10

    Рассчитать сумму чисел от а до в и вывести ее на экран.
    */
    
    //int a, b;
    //long long summa = 0;
    //cout << "\nВведите нижнюю и верхнюю границы диапазона (a < b): ";

    //cin >> a >> b;

    //if (a < b)
    //{
    //    while (a <= b)
    //    {
    //        cout << a << " ";
    //        summa += a;
    //        a++;

    //    }
    //    cout << "Сумма = " << summa;
    //}
    //else {
    //    cout << "Введены неверные данные";
    //}


    // ------------------------------------------------------------------------------------------------------------------- \\

    /*
        1.Пользователь вводит с клавиатуры 10 целых значений
        (положительных,  отрицательных, нулевых).


        2.Программа рассчитывает и выводит на экран количество и сумму
        положительных, отрицательных и нулевых значений.


        3.Расчитать и вывести на эран среднее положительных и отдельно
        среднее отрицательных чисел.
    */

    int k = 0, n, count_pos = 0, summa_pos= 0;
    cout << "\nВведи 5 целых чисел: \n";

    while (k < 5)
    {
        cout << k + 1 << ": ";
        cin >> n;

        if (n > 0)
        {
            summa_pos += n;
            count_pos++; // кол-во положительных
        }

        k++;
    }
    
    cout << "\nКоличество положительных:  " << count_pos;
    cout << "\nСумма положительных:  " << summa_pos;

    _getch();
}