#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>

using namespace std;

void main()
{

    setlocale(LC_ALL, "Russian");

  /*
  Напишите программу, которая запрашивает ввод целого числа
  с клавиатуры и выводит цифры этого числа в обратном порядке через пробел.
  Например, для числа 156 - вывод 6 5 1

  И посчитать сумму цифр числа 
  */

    //int num, summa;

    //cout << "\nEnter an integer: ";
    //cin >> num;

    //while (num)
    //{
    //    cout << num % 10 << " ";
    //    summa += num % 10;
    //    num /= 10;
    //}
    //

    // ------------------------------------------------------------------------------------------------------------------------------ \\


    /*
    Программа запрашивает целое число и выводит на экран его
    возможные делители, исключая единицу и само число.

    В случае отсутствия делителей – сообщение.
    */

    //int num, del = 2;
    //bool p = false; // Delitelei net

    //cout << "\nEnter an integer: ";
    //cin >> num;

    //cout << "\nDeliteli: ";
    //while (del <= num /2)
    //{
    //    if (num % del == 0)
    //    {
    //        cout << del << " ";
    //        p = true;
    //    }
    //    del++;
    //}

    //if (!p)
    //{
    //    cout << "netu";
    //}


    // ------------------------------------------------------------------------------------------------------------------------------ \\

    /*
    Программа запрашивает целое число и определяет,
    является ли оно простым, т.е. делится только на 1 и само число.
    */

    //int num, del = 2;
    //bool p = false; // Delitelei net

    //cout << "\nEnter an integer: ";
    //cin >> num;

    // Вариант 1 - с использование  brake;
    //while (del <= num /2)
    //{
    //    if (num % del == 0)
    //    {
    //        p = true;
    //        break;
    //    }
    //    del++;
    //}

    //cout << "\ndel - 1 = " << del - 1 << endl;

    //if (!p)
    //{
    //    cout << "\nCislo prostoe";
    //}
    //else {
    //    cout << "\ncislo ne prostoe";
    //}

    // Вариант 2 - без использование  brake   ( && !p );
    //while (del <= num / 2 && !p)
    //{
    //    if (num % del == 0)
    //    {
    //        p = true;
    //        
    //    }
    //    del++;
    //}

    //cout << "\ndel - 1 = " << del - 1 << endl;

    //if (!p)
    //{
    //    cout << "\nCislo prostoe";
    //}
    //else {
    //    cout << "\ncislo ne prostoe";
    //}



    // ------------------------------------------------------------------------------------------------------------------------------ \\



    /*
    Написать программу, которая определяет, существует ли
    четырехзначное число, куб суммы цифр которого равен
    самому числу (метод прямого перебора).
    (Ответ:  числа 4913 и 5832)

        k = 1000   до  9999 - цикл перебирает все 4-х значные числа

        s = 4+9+1+3 = 17
        17*17*17 = 4913

    */

    //int k = 1000, summa, copy;
    //while (k < 10000)
    //{
    //    summa = 0;
    //    copy = k;
    //    while (copy)
    //    {
    //        summa += copy % 10;
    //        copy /= 10;
    //    }

    //    if (pow(summa, 3) == k)
    //    {
    //        cout << k << endl;
    //    }
    //    k++;
    //}




   // ------------------------------------------------------------------------------------------------------------------------------ \\


/*
    1. Программа запрашивает пять оценок студента,
    рассчитывает и выводит на экран средний балл.
    (оценки считываются в одну переменную)



    2. Осуществлять правильность ввода оценки (от 1 до  10).
    В случае неверного ввода - сообщение.



    Программа заканчивает работу после ввода 5-ти верных оценок.
    */


    //int k = 0, num, summa = 0;

    //cout << "\nVvedite 5 ocenok studenta: \n";
    //do
    //{
    //    cout << k + 1 << ": ";
    //    cin >> num;
    //    if (num >=1 && num <= 10 )
    //    {
    //        summa += num;
    //        k++;
    //    }
    //    else {
    //        cout << "\nNevernaia ocenta (diapozon ot 1 do 10)";
    //    }
    //    
    //} while (k < 5);

    //cout << fixed << setprecision(2);
    //cout << "\nSrednii bal studenta: " << summa / 5.;



    // ------------------------------------------------------------------------------------------------------------------------------ \\

    /* 
    1. Программа запрашивает оценки четырех студентов, у каждого студента 5 оценок,
    рассчитывает и выводит на экран средний балл каждого студента.
    (оценки считываются в одну переменную)

    2. Осуществлять правильность ввода оценки(от 1 до  10).
    В случае неверного ввода - сообщение.

    3. расчитывает и выводит на экран средний бал студентов
    */


    //int k, num, summa;
    //double summaGroup = 0;
    //int st = 0;

    //while (st < 4) // перебор студентов
    //{
    //    cout << "\nVvedite 5 ocenok studenta(ot 1 do 10) " << st + 1 << endl;
    //    k = 0;
    //    summa = 0;
    //    do
    //    {
    //        cout << k + 1 << ": ";
    //        cin >> num;
    //        if (num >=1 && num <= 10 )
    //        {
    //            summa += num;
    //            k++;
    //        }
    //        else {
    //            cout << "\nNevernaia ocenta (diapozon ot 1 do 10) \n";
    //        }
    //    
    //    } while (k < 5);

    //    cout << fixed << setprecision(2);
    //    cout << "\nSrednii bal studenta: " << summa / 5.;
    //     
    //    summaGroup += summa / 5.;
    //    st++;
    //}

    //cout << "\nSrednii ball grup: " << summaGroup / 4.;




    // ------------------------------------------------------------------------------------------------------------------------------ \\
    // Конструкция for -------------------------------------------------------------------------------------------------------------- \\

    //for (int i = 0; i < 10; ++i)
    //{
    //    cout << " # " << i;
    //}
    
    //int k = 0;
    //for (; k < 15; ++k)
    //{
    //    cout << " # " << k + 1;
    //}
    //cout << "\n k =  " << k;


    // ------------------------------------------------------------------------------------------------------------------------------ \\


    /*
    Программа выводит на экран числа от 1 до 20  и находит их сумму
    */
    
    //int summa = 0;
    //for (int i = 1; i < 21; i++)
    //{
    //    cout << i << " ";
    //    summa += i;
    //}

    //cout << "\nSumma cisel: " << summa << endl;

    // ------------------------------------------------------------------------------------------------------------------------------ \\


    /*
    Программа выводит на экран  числа от 20 до 1
    */


    //for (int i = 20; i > 0; i--)
    //{
    //    cout << i << " ";
    //}


    // ------------------------------------------------------------------------------------------------------------------------------ \\

    /*
    Программа выводит на экран  четные числа от 10 до 0 и их сумму.
    */

    //int summa = 0;
    //for (int i = 10; i >= 0; i -= 2)
    //{
    //    cout << i << " ";
    //    summa += i;
    //}

    //cout << "\nSumma ciotnix znacenii: " << summa << endl;


    // ------------------------------------------------------------------------------------------------------------------------------ \\

    
    //for (int i = 1; i <= 10; i++)
    //{
    //    if (i != 5 && i != 8) {
    //        cout << i << " ";
    //    }
    //}

    //cout << endl;

    //for (int i = 1; i <= 10; i++)
    //{
    //    if (i == 5 || i == 8) {
    //        continue; // пропускает низлежащий код
    //    }

    //    cout << i << " ";
    //}

    //cout << endl;

    //for (int i = 1; i <= 100; i++)
    //{
    //    if (i >= 50 && i <= 80) {
    //        continue; // пропускает низлежащий код
    //    }

    //    cout << i << " ";
    //}

    //cout << endl;

    //int t = 0;

    //while (t < 10)
    //{
    //    t++;
    //    if (t == 5 || t == 8) {
    //        continue; // пропускает низлежащий код
    //    }
    //    cout << t << " ";
    //}

    _getch();
}