#include <iostream>
#include <stdlib.h>
#include <iomanip> // Манипулыторы форматированного ввода / вывода
#include <conio.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	//cout << 'a'  << endl; //a

	//// Результат арефметической операции автоматически приводтся к более высокому типу
	//cout << 'a' + 1 << endl;//97 + 1 = 98 
	//cout << 'a' + 1 << endl << (char)('a' + 1) << endl; //b
	//cout << '1' + 1 << endl; //49 + 1 = 50

	//// Константы - диапазон значений для рахных типов
	//cout << INT_MAX << endl << UINT_MAX << " = " << 0xffffffff << endl;

	//cout << 4294967295 << hex << " = " << 4294967295 << endl;

	//cout << 23654 << " = " << dec << 23654 << " = " << oct << 23654 << dec;

	//cout << endl << endl;

	//// setprecision - манипулятор, принимает общее количество выводимых знаком (цифр)
	//cout << setprecision(20); // По умолчанию 6 цифр. Этим способом мы явно указали чтобы выдавал 20
	//cout << 10 / 3. << endl; // 3. - double
	//cout << 10 / 3.f << endl; // 3.f - float

	//cout << (2.54e20 + 1 - 2.54e20) << endl; // e20 =  0 из-за мусора потеря точности
	//cout << (2.54e15 + 1 - 2.54e15) << endl; // e15 =  1 из-за точности

	//cout << endl;

	//// fixed - вывод числа с фиксированной точкой
	//cout << 313213654654.54654 * 32132132131 * 354654656 << endl;
	//// cout << fixed << 313213654654.54654 * 32132132131 * 354654656 << endl;

	//// Примечание: комбинация setprecision и fixed
	//// приводит к тому, что setprecision - регулирует кол-во знаков после точки.

	//cout << setprecision(2) << fixed << 5 / 2. << endl;

	//cout << endl << endl;
	//cout << "--------------------------------------------------------------------------------------";
	//cout << endl << endl;


	//--------------------------------------------------------------------------------------\\
	// Переменные / Variable - именной участок памяти, характереризуется:
	// - тип
	// - обьем памяти
	// - имя
	// - значение

	// Обьявление переменной: тип  имя_переменной;

	{
		int a, b, summa, sub;
		long long mult;
		double devide;

		a = 23;
		b = 7;

		summa = a + b;
		sub = a - b;
		mult = a * b;
		devide = (float)a / b;


		cout << "a = " << a << endl;  // Error C4700 uninitialized local variable 'a' , когда нет  a = 25;
		cout << "b = " << b << endl;  // Error C4700 uninitialized local variable 'a' , когда нет  a = 25;

		cout << endl;

		cout << a << " + " << b << " = " << a + b << endl;
		cout << a << " + " << b << " = " << summa << endl;
		cout << a << " - " << b << " = " << sub << endl;
		cout << a << " * " << b << " = " << mult << endl;
		cout << a << " / " << b << " = " << devide << endl;
		cout << setprecision(2) << fixed << a << " / " << b << " = " << devide << endl;
	}

	//--------------------------------------------------------------------------------------------------------------\\


	//int a, b, summa, sub;
	//long long mult;
	//double devide;
	//
	////cout << "\nВведите первое целое число: ";
	////cin >> a;
	////cout << "\nВведите второе целое число: ";
	////cin >> b;

	//cout << "\nВведите два целых числа: ";
	//cin >> a >> b;


	//summa = a + b;
	//sub = a - b;
	//mult = a * b;
	//devide = (double)a / b;


	//cout << "a = " << a << endl;  // Error C4700 uninitialized local variable 'a' , когда нет  a = 25;
	//cout << "b = " << b << endl;  // Error C4700 uninitialized local variable 'a' , когда нет  a = 25;

	//cout << endl;
	//cout << setprecision(2) << fixed;

	//cout << a << " + " << b << " = " << a + b << endl;
	//cout << a << " + " << b << " = " << summa << endl;
	//cout << a << " - " << b << " = " << sub << endl;
	//cout << a << " * " << b << " = " << mult << endl;
	//cout << a << " / " << b << " = " << devide << endl;
	//cout << a << " / " << b << " = " << devide << endl;

	//--------------------------------------------------------------------------------------------------------------\\

	/*
	Даны две переменные целого типа. Рассчитать и вывести на экран их среднее
					арифметическое значение дробного типа.
	*/

	//int n1, n2;
	//double media;

	//cout << "\nВВедите два целых числа: ";
	//cin >> n1 >> n2;

	//// media = (n1 + n2) / 2.;// - double
	//media = (n1 + n2) / 2.f; // - float
	//media = (double)(n1 + n2) / 2; // - double

	//cout << "\nСреднее арифметическое значение: " << media;


	//--------------------------------------------------------------------------------------------------------------\\

	/*
	Дана  величина в градусах по Фаренгейту(дробная),
	рассчитать ее эквивалент по Цельсию.
	Формула:  C = (F – 32) / 1.8  Сохранить результат в переменной.
	*/
	
	//double far, cel;
	//cout << "\nВеличина в градусах по Фаренгейту (дробная): ";
	//cin >> far;
	//cout << "\nfar: " << far << endl;
	//cel = (far - 32) / 1.8;

	//cout << "\nВеличина в градусах по Цельсию: " << cel;


	//--------------------------------------------------------------------------------------------------------------\\

	/*
	Дана  величина в  градусах по Цельсию, рассчитать ее эквивалент по Фаренгейту.
	Формула:  F = 1.8 * C + 32
	*/

	double far, cel;
	cout << "\nВеличина в градусах по Цельсию: ";
	cin >> cel;
	cout << "\ncel: " << cel << endl;
	far = 1.8 * cel + 32;

	cout << "\nВеличина в градусах по Фаренгейту: " << far;


	_getch();
}