#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>

using namespace std;

void main()
{
    //setlocale(LC_ALL, "rus");
    SetConsoleOutputCP(1251);

    // ----------------------------------------------------------- Повторение -------------------------------------------------------------------------- \\
    // 
    //int x, res;
    //int d1, d2, d3, d4;

    //cin >> x;
    //cout << x << endl;

    //if (x <= 9999 && x >= 1000)
    //{
    //    d1 = x / 1000;
    //    d2 = x % 1000 / 100;
    //    d3 = x % 100 / 10;
    //    d4 = x % 10;

    //    cout << "Res = " << d1 << d2 << d3 << d4 << endl;
    //    res = d1 * 1000 + d2 * 100 + d3 * 10 + d4;
    //}
    //else {
    //    cout << "\nВвели неверные данные";
    //}


    // -------------------------------------------------------------- Массивы ----------------------------------------------------------------------------- \\
   
    // Одномерные массивы
    // тип имя_массива[количество элемнетов];  - объявление массива
    // количество элемнетов - это константа

    //const int N = 5;

    //int max;
    //int mass[N] = { 4, 1, 3, 5, 6};
    //

    //for (int i = 0; i < 5; i++)
    //{
    //    cout << mass[i] << " ";

    //    max = mass[0];

    //    max < mass[i] ? max = mass[i] : max;
    //}
    //cout << "\nMax = " << max;

    //------------------------------------------------------------------------------------------------------------------------
    // Вариант 1 - Объявление и инициализация массива на этапе разработки

    //const int S = 10;
    //int grades[S]{ 9, 2 , 10, 7, 8 , 6, 3 ,9 ,8 ,7};

    //cout << grades[5] << endl << grades[S - 1] << endl;
    //cout << "\nДанные массива: " << endl;
    //for (int i = 0; i < S; i++)
    //{
    //    cout << grades[i] << " ";
    //}
    //cout << endl;
    //cout << endl << "Адрес массива: " << grades << endl; // Адрес массива
    //cout << endl << "Адрес массива[0] в формате int: " << (int)&grades[0] << endl;  // Адрес массива[0] в формате int:
    //cout << endl << "Адрес массива[1] в формате int: " << (int)&grades[1] << endl;  // Адрес массива[1] в формате int:

    //cout << "\nОбьем памяти под массив: " << sizeof(grades) << endl; // 40
    //cout << "\nОбьем памяти под массив: " << S * sizeof(int) << endl; // 10 * 4 = 40 

    //------------------------------------------------------------------------------------------------------------------------
    // Вариант 2 Объявление и инициализация массива без указания количества элементов 

    //int m[]{ 5, 256, -65, 3 };

    //cout << "\nОбьем памяти под массив: " << sizeof(m) << endl; // 4  * sizeof(int)  = 16

    //int size = sizeof(m) / sizeof(int);
    //cout << "\nSize = " << size << endl;

    //for (int i = 0; i < size; i++)
    //{
    //    cout << m[i] << " ";
    //}

    //------------------------------------------------------------------------------------------------------------------------
    // Инициализация значений массива с клавиатуры

    const int M = 7;
    int temp[M];

    cout << "\nВведи температуру воздуха за неделю: \n";

    for (int i = 0; i < M; i++)
    {   
        cout << i + 1 << ": ";
        cin >> temp[i];
    }
    cout << "\nВДанные массива: \n";
    for (int i = 0; i < M; i++)
    {
        cout << temp[i] << " ";
    }

    _getch();
}