#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>

using namespace std;

long get_degree(int num, int degree)
{
    if (num <= 0)
    {
        return 0;
    }

    if (degree == 0)
    {
        return 1;
    }

    return num * get_degree(num, degree - 1);
}

void show_num(int n)
{
    if (n)
    {
        show_num(n / 10);
        cout << n % 10 << " ";
    } 
}

void show_num_symbol(char symbol, int n)
{
    if (n)
    {
        show_num_symbol(symbol, n / 10);
        cout << n % 10 << " " << symbol << " ";
    }
}

long long summ_numbers(int a, int b)
{
    if (a < b)
    {
        return b + summ_numbers(a, b - 1);
    }
    else if (a > b)
    {
        return a + summ_numbers(a - 1, b);
    }
}

int main()
{
    //setlocale(LC_ALL, "rus"); 43 05

    // ------------------------------------------------------------------------------------------------------------------------ //
    /*Задание 1: Напишите рекурсивную функцию нахождения степени числа(число и
    степень – целые числа).*/

    //int num = 5, degree = 4;
    //cout << "\n Степень " << degree << " числа " << num << " равна = " << get_degree(num, degree);


    // ------------------------------------------------------------------------------------------------------------------------ //
    /*Задание 2: Напишите рекурсивную функцию, которая принимает целое число и выводит
    цифры этого числа слева направо, с разделением пробелом.*/

    //show_num(123456);


    // ------------------------------------------------------------------------------------------------------------------------ //
    /*Задание 3: Напишите рекурсивную функцию, которая принимает целое число, символ,
    и выводит цифры числа слева направо, разделив их символом.*/

    //show_num_symbol('^', 123456);


    // ------------------------------------------------------------------------------------------------------------------------ //
    /*Задание 4: Напишите рекурсивную функцию, которая вычисляет сумму всех чисел в
    диапазоне от a до b.Проиллюстрируйте работу функции примерами, когда a > b,
    a < b, a = b.*/


    //cout << "\nСумма от " << 1 << " до " << 5 << " = " << summ_numbers(1, 5) << endl;
    //cout << "\nСумма от " << 5 << " до " << 1 << " = " << summ_numbers(5, 1) << endl;
    //cout << "\nСумма от " << 3 << " до " << 3 << " = " << summ_numbers(3, 3) << endl;





    _getch();
}