#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>
#include "array_functions.h"
#include "help_functions.h"
#include "my_template.h"

using namespace std;

// Макрос
// #define Имя_макроса(Выражение)
#define LINE {for(int i = 0; i < 10; i++) cout << "="; cout << endl;}

// #define Имя_макроса(Параметры)(Выражение) - Параметризированный макрос
#define SUMMA(X,Y) ((X)+(Y))

#define MAX(X,Y) ((X) > (Y) ? (X) : (Y))

#define SQ(X) ((X) * (X))

#define PRINT(X) cout << X;


int main()
{

    //setlocale(LC_ALL, "rus");

    // ---------------------------------------------------------------------------------------------------------------- //

    //cout << "\nПлощадь прямоугольника: " << area(5, 4) << endl;

    //cout << "\nПлощадь круга: " << area(5) << endl;
    
    

    // ---------------------------------------------------------------------------------------------------------------- //

        
    //print((unsigned)25);


    // ---------------------------------------------------------------------------------------------------------------- //



    //// Макросы
    //#define N // Имя макроса
    //#define SIZE 10
    //int arr[SIZE]{25,3};
    //
    //LINE;

    //cout << SUMMA(5, 12) << endl;
    //cout << SUMMA(3.25, 12.58) << endl;
    //cout << SUMMA('+', '*') << endl;

    //cout << "Maximum = " << MAX(10, 15) << endl;
    //cout << "Maximum = " << MAX(12.45, 90.98) << endl;
    //cout << "Maximum = " << MAX('2', '+') << endl; // 2
    //cout << "Maximum = " << MAX(2 + 3, 10 + 9) << endl; // 19

    //cout << "Квадрат числа = " << SQ(5) << endl; // 25 
    //cout << "Квадрат числа = " << SQ(2 + 3) << endl;  // 25
    //cout << setprecision(2) << fixed;
    //cout << SQ(SUMMA(10, 2.5)) << endl;

    //PRINT(arr)



    // ---------------------------------------------------------------------------------------------------------------- //
    // Шаблоны функции **************************************************************************************************
   
    // Шаблоны функций — это функции,     
    //которые служат образцом для создания других подобных функций.    
    //Cоздание функций без указания точного типа(ов) некоторых или всех переменных.   

    /*    Написать шаблон функции для вывода значений    одномерного массива любого типа на экран.    */

    //const int N = 10;

    //int arr[N];
    //fill(arr, N, 1, 100);
    //// show(arr, N); // Вызов родной функции для типов Int
    //show<int>(arr, N);

    //const int M = 10;
    //double md[M]{ 25.25,5.89,-12.56,126.36,89.12 };
    //// show(md, M);
    //show<double>(md, M);

    //char math[M]{ '+','-', '*', '/', '%' };
    //// show(math, M);
    //show<char>(math, M); // <> Выхов шаблона для типо который указан в <>

    //cout << endl << endl;

    //const int ROW = 3;
    //int mi[ROW][COL];
    //float mir[ROW][COL];
    //fill(mi, ROW, -5, 25);
    //show<int>(mi, ROW);
    //show(mi, ROW);

    //show<float>(mir, ROW);



    // ---------------------------------------------------------------------------------------------------------------- //

    /*    Написать шаблон функции для определения и возврата    максимума одномерного массива    */

    //const int M = 10;
    //double md[M]{ 25.25,5.89,-12.56,126.36,89.12 };
    //int mdi[M]{ 25,5,-12,126,89 };
    //char math[M]{ '+','-', '*', '/', '%' };
    //cout << "\nMax double: " << maximum<double>(md, M);
    //cout << "\nMax int: " << maximum<int>(mdi, M);
    //cout << "\nMax char: " << maximum<char>(math, M);

    // ---------------------------------------------------------------------------------------------------------------- //

    /*    Написать шаблон функции для нахождения(возврат)    максимального значения из двух переменных    ОДНОГО типа    */

    //cout << "\nMaximum two num: " << maximum<int>(5, 25);
    //cout << "\nMaximum two num: " << maximum<double>(500.36, 25.56);
    //cout << "\nMaximum two num: " << maximum<char>('a', 'b');


    // ---------------------------------------------------------------------------------------------------------------- //
    
    /*    Написать шаблон функции для нахождения(возврат)    максимального значения из двух переменных    РАЗНОГО типа    */

    //cout << "\nMaximum two num: " << maximum<int>('a', 25); // 97
    //cout << "\nMaximum two num: " << maximum<char>('a', 25); // a

    //cout << "\nMaximum two num: " << maximum(25, 250.56); 
    //cout << "\nMaximum two num: " << maximum<int, double>(25, 250.56); 
    //cout << "\nMaximum two num: " << maximum<int, double>(25.2, 2);
    //cout << "\nMaximum two num: " << maximum<double, int>(25.2, 2);



    // ---------------------------------------------------------------------------------------------------------------- //

    /*    Самостоятельно:    Написать шаблон функции для сортировки одномерного массива    методом "пузырька".    */
    
    const int M = 5;
    double md[M]{ 25.25,5.89,-12.56,126.36,89.12 };
    show<double>(md, M);
    sort<double>(md, M);
    show<double>(md, M);





    _getch();
}