#include <iostream>
#include <stdlib.h>
#include <iomanip> 
#include <conio.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	//------------------------------------------------------------------------------------

	//Задание 3. Напишите программу для вычисления периметра прямоугольника.Исходные
	//данные целого типа(размеры сторон прямоугольника), вводятся с клавиатуры.

	//------------------------------------------------------------------------------------

	float length, width, total;
	cout << "Введите исходные данные : \n";
	cout << "Длина : ";
	cin >> length;

	cout << "Ширина : ";
	cin >> width;

	// p = (a + b) * 2.
	total = (length + width) * 2;
	cout << "Площадь : " << total;

	_getch();
}