#include <iostream>
#include <stdlib.h>
#include <iomanip> 
#include <conio.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	//--------------------------------------------------------------------------------------

	// Задание 7. Напишите программу, которая преобразует введенное пользователем с клавиатуры
	// количество дней в количество полных недель и оставшихся дней.Например, пользователь ввел
	// 17 дней, программа должна вывести на экран 2 недели и 3 дня.


	//--------------------------------------------------------------------------------------

	int days, lostDay, weeks, defWeek = 7.;

	cout << "Введите количество дней: ";
	cin >> days;

	weeks = days / defWeek;
	lostDay = days % defWeek;

	cout << weeks << " недели и " << lostDay << " дня";

	_getch();
}