#include <iostream>
#include <stdlib.h>
#include <conio.h>
#include <iomanip>
#include <Windows.h>

using namespace std;


void main()
{
    //setlocale(LC_ALL, "rus");

    // --------------------------------------------------------------------------------------------------------- //
    // ---------------------------------------- Задание 2 ------------------------------------------------------ //
    // --------------------------------------------------------------------------------------------------------- //
    // Задание 4: Напишите программу, которая создает двухмерный массив размером N строк N
    // столбцов(квадратная матрица), инициализирует матрицу случайными значениями в выбранном
    // пользователем диапазоне(вводится с клавиатуры).Определить и вывести на экран
    // максимальное и минимальное значения на главной и вспомогательной диагоналях матрицы.
    // --------------------------------------------------------------------------------------------------------- //

    const int ROW = 4, COL = 4;
    int arr[ROW][COL], a = -10, b = 10;

    srand(time(0));

    //cout << "\nВведите диапозон чисел для массива: ";
    //cin >> a >> b;

    for (int i = 0; i < ROW; i++)
    {
        for (int j = 0; j < COL; j++)
        {
            
            int random = a > b ? (rand() % (a - b + 1) + b) : (rand() % (b - a + 1) + a);
            arr[i][j] = random;
        }
    }

    for (int i = 0; i < ROW; i++)
    {
        
        for (int j = 0; j < COL; j++)
        {
            cout << setw(4) << arr[i][0] << " ";  
        }
        cout << endl;
    }


    _getch();

}