#include <iostream>
#include <stdlib.h>
#include <iomanip> 
#include <conio.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	//--------------------------------------------------------------------------------------

	//Задание 4. Напишите программу для вычисления среднего балла(дробного типа) студента, у
	//которого 5 оценок(данные целого типа).Оценки вводятся с клавиатуры
	
	//--------------------------------------------------------------------------------------

	int b1, b2, b3, b4, b5;
	double media;

	cout << "ВВедите 5 оценок студента : ";
	cin >> b1 >> b2 >> b3 >> b4 >> b5;

	media = (double)(b1 + b2 + b3 + b4 + b5) / 5;

	cout << "Средний балл студента: " << media;

	_getch();
}